<h1><center> Python Data Cleaning Cookbook</center>

<h2><center>Chapter 1</center</h2>

In [19]:
# Importing a file from CSV 
import pandas as pd 
pd.options.display.float_format='{:,.2f}'.format    # Setting the display option of float values as 2
pd.set_option('display.width',85)       #Setting the width of columns as a standard width
pd.set_option('display.max_columns',8)      #Setting to display only 8 columns

In [3]:
#Importing tkniter library to dynamically choose the file rather than coding the path
import os
import sys
import tkinter as tk
from tkinter import filedialog

In [4]:
root=tk.Tk()
root.withdraw()
file1=filedialog.askopenfilename(title="Browse the required file...")

In [5]:
# Importing the CSV file, Setting the names of the columns and skipping the column headers in the csv file, Parsing the columns "Month and Year" as date "month_year"
landtemps=pd.read_csv(file1,names=['stationid','year','month','avgtemp','latitude','longitude','elevation','station','countryid','country'],skiprows=1,
    parse_dates=[['month','year']])

In [16]:
print(landtemps.head(7))    # To show the first 7 rows of the data.
print("\n\nData Types for the dataframe:")
print(landtemps.dtypes)     # To show the data types of all columns

  measuredate    stationid  avgtemp  latitude  ...  elevation           station  \
0  2000-04-01  USS0010K01S     5.27     39.90  ...   2,773.70     INDIAN_CANYON
1  1940-05-01  CI000085406    18.04    -18.35  ...      58.00             ARICA
2  2013-12-01  USC00036376     6.22     34.37  ...      61.00     SAINT_CHARLES
3  1963-02-01  ASN00024002    22.93    -34.28  ...      65.50  BERRI_IRRIGATION
4  2001-11-01  ASN00028007      nan    -14.78  ...      79.40          MUSGRAVE
5  1991-04-01  USW00024151     5.59     42.15  ...   1,362.50        MALAD_CITY
6  1993-12-01  RSM00022641   -10.17     63.90  ...      13.00             ONEGA

  countryid        country
0        US  United States
1        CI          Chile
2        US  United States
3        AS      Australia
4        AS      Australia
5        US  United States
6        RS         Russia

[7 rows x 9 columns]


Data Types for the dataframe:
measuredate    datetime64[ns]
stationid              object
avgtemp               float64
latitude              float64
longitude             float64
elevation             float64
station                object
countryid              object
country                object
dtype: object

In [17]:
landtemps.rename(columns={'month_year':'measuredate'},inplace=True)     # Renaming the Column "month_year" to "measuredate"
print(landtemps.dtypes)
print("\n\nData Types for the renamed df:")
print(landtemps.avgtemp.describe())

measuredate    datetime64[ns]
stationid              object
avgtemp               float64
latitude              float64
longitude             float64
elevation             float64
station                object
countryid              object
country                object
dtype: object


Data Types for the renamed df:
count   85,554.00
mean        10.92
std         11.52
min        -70.70
25%          3.46
50%         12.22
75%         19.57
max         39.95
Name: avgtemp, dtype: float64

In [22]:
print(landtemps.isnull().sum())       # To return any NULL values in any of the columns
print("\n\nThe dimensions of the existing dataframe are:")
print(landtemps.shape)      # To return the dimensions of the dataframe

measuredate        0
stationid          0
avgtemp        14446
latitude           0
longitude          0
elevation          0
station            0
countryid          0
country            5
dtype: int64


The dimensions of the existing dataframe are:
(100000, 9)

In [24]:
landtemps.dropna(subset=['avgtemp'],inplace=True)       # Dropping all the rows with NULL value in the column "AVGTEMP"
print("The dimensions of the dataframe after dropping Null values:")
print(landtemps.shape)

The dimensions of the dataframe after dropping Null values:
(85554, 9)

<h3> Importing Excel Files

In [25]:
# Using tkinter to browse the file
root.withdraw()
file_excel=filedialog.askopenfilename(title="Browse the required file...")

In [28]:
# Whenever the excel files doesnt have the data in starting Rows/Columns in a standard format, We import usint the following way. 
percapitaGDP=pd.read_excel(file_excel,
    sheet_name="OECD.Stat export",
    skiprows=4,
    skipfooter=1,
    usecols="A,C:T")
# The above code reads the file browsed, Checks for the specifies column, Skips the first four rows and the last footer row and only considers the columns A, C to T
percapitaGDP.head()

                         Year   2001   2002   2003  ...   2015   2016   2017   2018
0          Metropolitan areas    NaN    NaN    NaN  ...    NaN    NaN    NaN    NaN
1              AUS: Australia     ..     ..     ..  ...     ..     ..     ..     ..
2       AUS01: Greater Sydney  43313  44008  45424  ...  50075  50519  50578  49860
3    AUS02: Greater Melbourne  40125  40894  41602  ...  42928  42671  43025  42674
4     AUS03: Greater Brisbane  37580  37564  39080  ...  44388  45723  46876  46640

[5 rows x 19 columns]

In [29]:
percapitaGDP.info() # info method is used to view data types and the non-null count

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 702 entries, 0 to 701
Data columns (total 19 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    702 non-null    object
 1   2001    701 non-null    object
 2   2002    701 non-null    object
 3   2003    701 non-null    object
 4   2004    701 non-null    object
 5   2005    701 non-null    object
 6   2006    701 non-null    object
 7   2007    701 non-null    object
 8   2008    701 non-null    object
 9   2009    701 non-null    object
 10  2010    701 non-null    object
 11  2011    701 non-null    object
 12  2012    701 non-null    object
 13  2013    701 non-null    object
 14  2014    701 non-null    object
 15  2015    701 non-null    object
 16  2016    701 non-null    object
 17  2017    701 non-null    object
 18  2018    701 non-null    object
dtypes: object(19)
memory usage: 104.3+ KB

In [33]:
# In the above table, Column "Year" is a misnomer and has to be replaced along with leading spaces in the rows 
percapitaGDP.rename(columns={'Year':'metro'},inplace=True)      # This renames the column from "Year" to "metro"
print(percapitaGDP.metro.str.startswith(' ').any())       # Check if we have any values in the column that start with leading spaces
print(percapitaGDP.metro.str.endswith(' ').any())       # Check if there are any values in the column has trailing spaces

False
False

In [32]:
percapitaGDP.metro=percapitaGDP.metro.str.strip()       # Stripping off the leading and trailing spaces in the Column "metro"

In [34]:
# All the Data types in the columns are presented as object. We have to convert them to numeric.
for col in percapitaGDP.columns[1:]:
    percapitaGDP[col]=pd.to_numeric(percapitaGDP[col],errors='coerce')
    percapitaGDP.rename(columns={col:'pcGDP'+col},inplace=True)
# Using the for loop we have iterated from second row till last column, typecasting the values as numeric.
# Coerce is used so that the missing values marked as ".." in the data shall become NaN values
# The  last line is to replace add "pcGDP" to every Year in the column name.

In [37]:
percapitaGDP.dtypes # Note that every column except for the first column has turned to float type from object type

metro         object
pcGDP2001    float64
pcGDP2002    float64
pcGDP2003    float64
pcGDP2004    float64
pcGDP2005    float64
pcGDP2006    float64
pcGDP2007    float64
pcGDP2008    float64
pcGDP2009    float64
pcGDP2010    float64
pcGDP2011    float64
pcGDP2012    float64
pcGDP2013    float64
pcGDP2014    float64
pcGDP2015    float64
pcGDP2016    float64
pcGDP2017    float64
pcGDP2018    float64
dtype: object

In [38]:
percapitaGDP.describe()     # To generate summary satistics for all columns

,pcGDP2001,pcGDP2002,pcGDP2003,pcGDP2004,...,pcGDP2015,pcGDP2016,pcGDP2017,pcGDP2018
count,424.00,440.00,440.00,440.00,...,480.00,480.00,445.00,441.00
mean,"41,263.66","41,015.07","41,553.36","42,473.02",...,"45,802.22","46,243.67","47,489.09","48,032.67"
std,"11,877.96","12,536.52","12,456.58","12,621.90",...,"14,948.68","14,938.55","15,463.80","15,719.73"
min,"10,988.00","11,435.00","11,969.00","12,777.00",...,"2,761.00","2,796.00","2,745.00","2,832.00"
25%,"33,139.25","32,636.00","33,284.75","33,864.50",...,"36,128.50","36,584.75","37,316.00","37,908.00"
50%,"39,543.50","39,683.50","40,390.50","41,200.50",...,"43,237.50","43,931.50","45,385.00","46,057.00"
75%,"47,971.75","48,611.00","49,354.75","50,468.25",...,"54,134.25","54,449.75","56,023.00","56,638.00"
max,"91,488.00","93,566.00","98,123.00","96,242.00",...,"121,623.00","117,879.00","122,242.00","127,468.00"

In [39]:
# To drop rows where we have NaN values in all values columns i.e., from COl 2 to end
percapitaGDP.dropna(subset=percapitaGDP.columns[1:],how="all",inplace=True)

In [40]:
percapitaGDP.describe()

,pcGDP2001,pcGDP2002,pcGDP2003,pcGDP2004,...,pcGDP2015,pcGDP2016,pcGDP2017,pcGDP2018
count,424.00,440.00,440.00,440.00,...,480.00,480.00,445.00,441.00
mean,"41,263.66","41,015.07","41,553.36","42,473.02",...,"45,802.22","46,243.67","47,489.09","48,032.67"
std,"11,877.96","12,536.52","12,456.58","12,621.90",...,"14,948.68","14,938.55","15,463.80","15,719.73"
min,"10,988.00","11,435.00","11,969.00","12,777.00",...,"2,761.00","2,796.00","2,745.00","2,832.00"
25%,"33,139.25","32,636.00","33,284.75","33,864.50",...,"36,128.50","36,584.75","37,316.00","37,908.00"
50%,"39,543.50","39,683.50","40,390.50","41,200.50",...,"43,237.50","43,931.50","45,385.00","46,057.00"
75%,"47,971.75","48,611.00","49,354.75","50,468.25",...,"54,134.25","54,449.75","56,023.00","56,638.00"
max,"91,488.00","93,566.00","98,123.00","96,242.00",...,"121,623.00","117,879.00","122,242.00","127,468.00"

In [42]:
print(percapitaGDP.head())
print("\n\nThe Shape of the Dataframe is")
print(percapitaGDP.shape)

                      metro  pcGDP2001  pcGDP2002  pcGDP2003  ...  pcGDP2015  \
2     AUS01: Greater Sydney  43,313.00  44,008.00  45,424.00  ...  50,075.00
3  AUS02: Greater Melbourne  40,125.00  40,894.00  41,602.00  ...  42,928.00
4   AUS03: Greater Brisbane  37,580.00  37,564.00  39,080.00  ...  44,388.00
5      AUS04: Greater Perth  45,713.00  47,371.00  48,719.00  ...  66,544.00
6   AUS05: Greater Adelaide  36,505.00  37,194.00  37,634.00  ...  40,295.00

   pcGDP2016  pcGDP2017  pcGDP2018
2  50,519.00  50,578.00  49,860.00
3  42,671.00  43,025.00  42,674.00
4  45,723.00  46,876.00  46,640.00
5  66,032.00  66,424.00  70,390.00
6  39,737.00  40,115.00  39,924.00

[5 rows x 19 columns]


The Shape of the Dataframe is
(480, 19)

In [45]:
# Setting the index for the dataframe using the metro column: Before that verify if count of the rows is equal to the unique values.i.e., All rows are unique
print(percapitaGDP.metro.count())
print(percapitaGDP.metro.nunique() )

480
480

In [46]:
percapitaGDP.set_index('metro',inplace=True)
percapitaGDP.head()

,pcGDP2001,pcGDP2002,pcGDP2003,pcGDP2004,...,pcGDP2015,pcGDP2016,pcGDP2017,pcGDP2018
metro,,,,,,,,,
AUS01: Greater Sydney,"43,313.00","44,008.00","45,424.00","45,837.00",...,"50,075.00","50,519.00","50,578.00","49,860.00"
AUS02: Greater Melbourne,"40,125.00","40,894.00","41,602.00","42,188.00",...,"42,928.00","42,671.00","43,025.00","42,674.00"
AUS03: Greater Brisbane,"37,580.00","37,564.00","39,080.00","40,762.00",...,"44,388.00","45,723.00","46,876.00","46,640.00"
AUS04: Greater Perth,"45,713.00","47,371.00","48,719.00","51,020.00",...,"66,544.00","66,032.00","66,424.00","70,390.00"
AUS05: Greater Adelaide,"36,505.00","37,194.00","37,634.00","37,399.00",...,"40,295.00","39,737.00","40,115.00","39,924.00"

In [47]:
percapitaGDP.loc['AUS02: Greater Melbourne']

pcGDP2001   40,125.00
pcGDP2002   40,894.00
pcGDP2003   41,602.00
pcGDP2004   42,188.00
pcGDP2005   41,484.00
pcGDP2006   41,589.00
pcGDP2007   42,316.00
pcGDP2008   40,975.00
pcGDP2009   41,384.00
pcGDP2010   40,943.00
pcGDP2011   41,165.00
pcGDP2012   41,264.00
pcGDP2013   41,157.00
pcGDP2014   42,114.00
pcGDP2015   42,928.00
pcGDP2016   42,671.00
pcGDP2017   43,025.00
pcGDP2018   42,674.00
Name: AUS02: Greater Melbourne, dtype: float64

If a column name starts with Number and we try to call it say percapitaGDP.2001.count(), it will not work as Python identifier cannot start with a number

<h2> Importing Data from SQL databases

In [3]:
import numpy as np 
import pymssql

Connecting to a SQL server by mentioning Query and the connection details using pandas and "pymssql" API .

In [4]:
query="SELECT studentid, school, sex, age, famsize,medu as mothereducation,fedu as fathereducation,traveltime,studytime,failures,famrel,freetime,\
    goout,g1 as gradeperiod1,g2 as gradeperiod2,g3 as gradeperiod3 from studentmath"
server="pdcc.c9sqqzd5fulv.us-west-2.rds.amazonaws.com"
user="pdccuser"
password="pdccpass"
database="pdcctest"
conn = pymssql.connect(server=server,user=user,password=password,database=database)
studentmath = pd.read_sql(query,conn)
conn.close()

In [12]:
studentmath.head(10)

  studentid school sex  age  ... goout  gradeperiod1  gradeperiod2  gradeperiod3
0       001     GP   F   18  ...     4             5             6             6
1       002     GP   F   17  ...     3             5             5             6
2       003     GP   F   15  ...     2             7             8            10
3       004     GP   F   15  ...     2            15            14            15
4       005     GP   F   16  ...     2             6            10            10
5       006     GP   M   16  ...     2            15            15            15
6       007     GP   M   16  ...     4            12            12            11
7       008     GP   F   17  ...     4             6             5             6
8       009     GP   M   15  ...     2            16            18            19
9       010     GP   M   15  ...     1            14            15            15

[10 rows x 16 columns]

In [5]:
newcolorder=['studentid','gradeperiod1','gradeperiod2','gradeperiod3','school','sex','age','famsize','mothereducation','fathereducation','traveltime','studytime','freetime','failures','famrel','goout']       # Defining a new column order
studentmath=studentmath[newcolorder]        #Assigning the new column order to the existing table
# Check if there are any duplicates before creating index
print(studentmath.studentid.count())
print(studentmath.studentid.nunique())

395
395

In [6]:
# Creating Index on StudentId
studentmath.set_index('studentid',inplace=True)

In [7]:
# Check for missing values
studentmath.count()

gradeperiod1       395
gradeperiod2       395
gradeperiod3       395
school             395
sex                395
age                395
famsize            395
mothereducation    395
fathereducation    395
traveltime         395
studytime          395
freetime           395
failures           395
famrel             395
goout              395
dtype: int64

In [8]:
# Replace the nuerical values with Informative values
setvalues={"famrel":{1:"1:very bad",2:"2:bad",3:"3:neutral",4:"4:good",5:"5:excellent"},"freetime":{1:"1:very low",2:"2:low",3:"3:neutral",4:"4:high",5:"5:very high"},"goout":{1:"1:very low",2:"2:low",3:"3:neutral",4:"4:high",5:"5:very high"},"mothereducation":{0:np.NaN,1:"1: k-4",2:"2: 5-9",3:"3: Secondary ed",4:"4: Higher ed"},"fathereducation":{0:np.NaN,1:"1: k-4",2:"2: 5-9",3:"3: Secondary ed",4:"4: Higher ed"}}

studentmath.replace(setvalues,inplace=True)
setvalueskeys=[k for k in setvalues] # Creates a list of all the column names mentioned in the dictionary setvalues

In [12]:
# Chaning the Setvalue columns to Category typr
studentmath[setvalueskeys].memory_usage(index=False)    # Initial Memory usage

famrel             3160
freetime           3160
goout              3160
mothereducation    3160
fathereducation    3160
dtype: int64

In [13]:
# Iterating over the column names in the setvalues to convert them as a category
for col in studentmath[setvalueskeys].columns:
    studentmath[col]=studentmath[col].astype('category')
studentmath[setvalueskeys].memory_usage(index=False)

famrel             595
freetime           595
goout              595
mothereducation    587
fathereducation    587
dtype: int64

In [14]:
# Calculate the percentage of Values in "Famrel" column
studentmath['famrel'].value_counts(sort=False,normalize=True)

1:very bad    0.02
2:bad         0.05
3:neutral     0.17
4:good        0.49
5:excellent   0.27
Name: famrel, dtype: float64

In [15]:
# For getting multiple columns Values percentage use apply function
studentmath[['freetime','goout']].apply(pd.Series.value_counts,sort=False,normalize=True)

             freetime  goout
1:very low       0.05   0.06
2:low            0.16   0.26
3:neutral        0.40   0.33
4:high           0.29   0.22
5:very high      0.10   0.13

In [16]:
studentmath[['mothereducation','fathereducation']].apply(pd.Series.value_counts,sort=False,normalize=True)

                 mothereducation  fathereducation
1: k-4                      0.15             0.21
2: 5-9                      0.26             0.29
3: Secondary ed             0.25             0.25
4: Higher ed                0.33             0.24

<h2> Importing SPSS,STata and SAS Data

In [28]:
# We use pyreadstat package to read data from the three mentioned statistical packages
import pandas as pd 
import numpy as np 
import pyreadstat

In [29]:
root=tk.Tk()
root.withdraw()
sav_file=filedialog.askopenfilename(title="Browse the required file...")

In [30]:
nls97spss,metaspss=pyreadstat.read_sav(sav_file) # In Stat Files, Metadata has the Column inforrmation the main dataframe columns are not intuitive

In [31]:
nls97spss.head()

,R0000100,R0536300,R0536401,R0536402,...,U2962800,U2962900,U2963000,Z9063900
0,1.00,2.00,9.00,"1,981.00",...,nan,nan,nan,52.00
1,2.00,1.00,7.00,"1,982.00",...,4.00,2.00,6.00,0.00
2,3.00,2.00,9.00,"1,983.00",...,6.00,2.00,6.00,0.00
3,4.00,2.00,2.00,"1,981.00",...,3.00,2.00,6.00,4.00
4,5.00,1.00,10.00,"1,982.00",...,2.00,2.00,5.00,12.00

In [32]:
print(nls97spss['R0536300'].value_counts(normalize=True))
print("\n\n Metadata for the column R0536300 is:\n")
print(metaspss.variable_value_labels['R0536300'])

1.00   0.51
2.00   0.49
Name: R0536300, dtype: float64


 Metadata for the column R0536300 is:

{0.0: 'No Information', 1.0: 'Male', 2.0: 'Female'}

In [33]:
# Grabbing meta data to improve column labels and value labels. Ensure if the Mapping of the Meta data is correct or not.
nls97spss['R0536300'].map(metaspss.variable_value_labels['R0536300']).value_counts()

Male      4599
Female    4385
Name: R0536300, dtype: int64

In [34]:
# Normalizing the above
nls97spss['R0536300'].map(metaspss.variable_value_labels['R0536300']).value_counts(normalize=True)

Male     0.51
Female   0.49
Name: R0536300, dtype: float64

In [35]:
#Applying the datalabels to the data
nls97spss=pyreadstat.set_value_labels(nls97spss,metaspss,formats_as_category=True)

In [36]:
nls97spss.head()

,R0000100,R0536300,R0536401,R0536402,...,U2962800,U2962900,U2963000,Z9063900
0,1.00,Female,9.00,"1,981.00",...,NaN,NaN,nan,52.00
1,2.00,Male,7.00,"1,982.00",...,4 to 6 hours a week,3 to 10 hours a week,6.00,0.00
2,3.00,Female,9.00,"1,983.00",...,10 hours or more a week,3 to 10 hours a week,6.00,0.00
3,4.00,Female,2.00,"1,981.00",...,1 to 3 hours a week,3 to 10 hours a week,6.00,4.00
4,5.00,Male,10.00,"1,982.00",...,Less than 1 hour a week,3 to 10 hours a week,5.00,12.00

In [37]:
# Applying Column headers to the data
nls97spss.columns=metaspss.column_labels
nls97spss.head()

,PUBID - YTH ID CODE 1997,KEY!SEX (SYMBOL) 1997,KEY!BDATE M/Y (SYMBOL) 1997,KEY!BDATE M/Y (SYMBOL) 1997,...,HRS/WK R USES A COMPUTER 2017,HRS/WK R WATCHES TELEVISION 2017,HRS/NIGHT R SLEEPS 2017,CVC_WKSWK_YR_ALL L99
0,1.00,Female,9.00,"1,981.00",...,NaN,NaN,nan,52.00
1,2.00,Male,7.00,"1,982.00",...,4 to 6 hours a week,3 to 10 hours a week,6.00,0.00
2,3.00,Female,9.00,"1,983.00",...,10 hours or more a week,3 to 10 hours a week,6.00,0.00
3,4.00,Female,2.00,"1,981.00",...,1 to 3 hours a week,3 to 10 hours a week,6.00,4.00
4,5.00,Male,10.00,"1,982.00",...,Less than 1 hour a week,3 to 10 hours a week,5.00,12.00

In [38]:
nls97spss.dtypes

PUBID - YTH ID CODE 1997                        float64
KEY!SEX (SYMBOL) 1997                          category
KEY!BDATE M/Y (SYMBOL) 1997                     float64
KEY!BDATE M/Y (SYMBOL) 1997                     float64
CV_SAMPLE_TYPE 1997                            category
KEY!RACE_ETHNICITY (SYMBOL) 1997               category
TRANS_SAT_VERBAL HSTR                           float64
TRANS_SAT_MATH HSTR                             float64
TRANS CRD GPA OVERALL HSTR                      float64
TRANS CRD GPA ENG HSTR                          float64
TRANS CRD GPA MATH HSTR                         float64
TRANS CRD GPA LP SCI HSTR                       float64
GOVT RESPONSIBILITY - PROVIDE JOBS 2006        category
GOVT RESPNSBLTY - KEEP PRICES UND CTRL 2006    category
GOVT RESPNSBLTY - HLTH CARE FOR SICK 2006      category
GOVT RESPNSBLTY -PROV ELD LIV STAND 2006       category
GOVT RESPNSBLTY -PROV IND HELP 2006            category
GOVT RESPNSBLTY -PROV UNEMP LIV STAND 2006     category
GOVT RESPNSBLTY -REDUCE INC DIFF 2006          category
GOVT RESPNSBLTY -PROV COLL FIN AID 2006        category
GOVT RESPNSBLTY -PROV DECENT HOUSING 2006      category
GOVT RESPNSBLTY -PROTECT ENVIRONMENT 2006      category
CV_BA_CREDITS L1 2011                           float64
CV_COLLEGE_TYPE L1 2017                        category
CV_COLLEGE_TYPE L2 2017                        category
CV_COLLEGE_TYPE L3 2017                        category
CV_COLLEGE_TYPE L4 2017                        category
CV_COLLEGE_TYPE L5 2017                        category
CV_COLLEGE_TYPE L6 2017                        category
CV_HGC_EVER 2017                               category
CV_MARSTAT_COLLAPSED 2017                      category
CV_BIO_CHILD_HH 2017                            float64
CV_BIO_CHILD_NR 2017                            float64
DIPLOMA/DEGREE RCVD? L1 2017                   category
DIPLOMA/DEGREE RCVD? L2 2017                   category
DIPLOMA/DEGREE RCVD? L3 2017                   category
DIPLOMA/DEGREE RCVD? L4 2017                   category
EST INC WAGES, TIPS PAST YR 2017               category
HRS/WK R USES A COMPUTER 2017                  category
HRS/WK R WATCHES TELEVISION 2017               category
HRS/NIGHT R SLEEPS 2017                         float64
CVC_WKSWK_YR_ALL L99                            float64
dtype: object

In [41]:
nls97spss.columns=nls97spss.columns.str.lower().str.replace(' ','_').str.replace('[^a-z0-9_]',"")
# The above line converts the column headers to lower case, replaces ' ' with '_' and replace all no alphanumeric values, excluding '_' with ''
nls97spss.set_index('pubid__yth_id_code_1997',inplace=True)
nls97spss.head()
# Whenever we have set a column to Index nd re-run the same cell again, we get an error as the coloumn is already present as index.

KeyError: "None of ['pubid__yth_id_code_1997'] are in the columns"

In [43]:
#Value labels can set to the file while puylling the data itself
nls97spss,metaspss=pyreadstat.read_sav(sav_file,apply_value_formats=True,formats_as_category=True)
nls97spss.columns=metaspss.column_labels
nls97spss.columns=nls97spss.columns.str.lower().str.replace(' ','_').str.replace('[^a-z0-9_]',"")
nls97spss.columns=nls97spss.columns.str.lower().str.replace('__','_')# Replacing double underscore with single
nls97spss.dtypes

pubid_yth_id_code_1997                        float64
keysex_symbol_1997                           category
keybdate_my_symbol_1997                       float64
keybdate_my_symbol_1997                       float64
cv_sample_type_1997                          category
keyrace_ethnicity_symbol_1997                category
trans_sat_verbal_hstr                         float64
trans_sat_math_hstr                           float64
trans_crd_gpa_overall_hstr                    float64
trans_crd_gpa_eng_hstr                        float64
trans_crd_gpa_math_hstr                       float64
trans_crd_gpa_lp_sci_hstr                     float64
govt_responsibility_provide_jobs_2006        category
govt_respnsblty_keep_prices_und_ctrl_2006    category
govt_respnsblty_hlth_care_for_sick_2006      category
govt_respnsblty_prov_eld_liv_stand_2006      category
govt_respnsblty_prov_ind_help_2006           category
govt_respnsblty_prov_unemp_liv_stand_2006    category
govt_respnsblty_reduce_inc_diff_2006         category
govt_respnsblty_prov_coll_fin_aid_2006       category
govt_respnsblty_prov_decent_housing_2006     category
govt_respnsblty_protect_environment_2006     category
cv_ba_credits_l1_2011                         float64
cv_college_type_l1_2017                      category
cv_college_type_l2_2017                      category
cv_college_type_l3_2017                      category
cv_college_type_l4_2017                      category
cv_college_type_l5_2017                      category
cv_college_type_l6_2017                      category
cv_hgc_ever_2017                             category
cv_marstat_collapsed_2017                    category
cv_bio_child_hh_2017                          float64
cv_bio_child_nr_2017                          float64
diplomadegree_rcvd_l1_2017                   category
diplomadegree_rcvd_l2_2017                   category
diplomadegree_rcvd_l3_2017                   category
diplomadegree_rcvd_l4_2017                   category
est_inc_wages_tips_past_yr_2017              category
hrswk_r_uses_a_computer_2017                 category
hrswk_r_watches_television_2017              category
hrsnight_r_sleeps_2017                        float64
cvc_wkswk_yr_all_l99                          float64
dtype: object

In [45]:
#Running Frequencies on one of the columns and setting Index to the data
print(nls97spss.govt_responsibility_provide_jobs_2006.value_counts(sort=False))
nls97spss.set_index('pubid_yth_id_code_1997',inplace=True)

Definitely should be        454
Definitely should not be    300
Probably should be          617
Probably should not be      462
Name: govt_responsibility_provide_jobs_2006, dtype: int64

**Importing Stata data**

In [49]:
root.withdraw()
dta_file=filedialog.askopenfilename(title="Browse the file...")

In [51]:
# Reading the dat file, applying the data value formats using the metafile , renaming the columns
nlss97stata,metastata=pyreadstat.read_dta(dta_file,apply_value_formats=True,formats_as_category=True)
nlss97stata.columns=metastata.column_labels
nlss97stata.columns=nlss97stata.columns.str.lower().str.replace(' ','_').str.replace('[^a-z0-9_]','')
nlss97stata.columns=nlss97stata.columns.str.replace('__','_') # Replacing double underscore in the headers with single underscore
nlss97stata.dtypes

pubid_yth_id_code_1997                        float64
keysex_symbol_1997                           category
keybdate_my_symbol_1997                       float64
keybdate_my_symbol_1997                       float64
cv_sample_type_1997                          category
keyrace_ethnicity_symbol_1997                category
trans_sat_verbal_hstr                         float64
trans_sat_math_hstr                           float64
trans_crd_gpa_overall_hstr                    float64
trans_crd_gpa_eng_hstr                        float64
trans_crd_gpa_math_hstr                       float64
trans_crd_gpa_lp_sci_hstr                     float64
govt_responsibility_provide_jobs_2006        category
govt_respnsblty_keep_prices_und_ctrl_2006    category
govt_respnsblty_hlth_care_for_sick_2006      category
govt_respnsblty_prov_eld_liv_stand_2006      category
govt_respnsblty_prov_ind_help_2006           category
govt_respnsblty_prov_unemp_liv_stand_2006    category
govt_respnsblty_reduce_inc_diff_2006         category
govt_respnsblty_prov_coll_fin_aid_2006       category
govt_respnsblty_prov_decent_housing_2006     category
govt_respnsblty_protect_environment_2006     category
cv_ba_credits_l1_2011                         float64
cv_college_type_l1_2017                      category
cv_college_type_l2_2017                      category
cv_college_type_l3_2017                      category
cv_college_type_l4_2017                      category
cv_college_type_l5_2017                      category
cv_college_type_l6_2017                      category
cv_hgc_ever_2017                             category
cv_marstat_collapsed_2017                    category
cv_bio_child_hh_2017                          float64
cv_bio_child_nr_2017                          float64
diplomadegree_rcvd_l1_2017                   category
diplomadegree_rcvd_l2_2017                   category
diplomadegree_rcvd_l3_2017                   category
diplomadegree_rcvd_l4_2017                   category
est_inc_wages_tips_past_yr_2017              category
hrswk_r_uses_a_computer_2017                 category
hrswk_r_watches_television_2017              category
hrsnight_r_sleeps_2017                        float64
cvc_wkswk_yr_all_l99                          float64
dtype: object

In [52]:
nlss97stata.head()

,pubid_yth_id_code_1997,keysex_symbol_1997,keybdate_my_symbol_1997,keybdate_my_symbol_1997,...,hrswk_r_uses_a_computer_2017,hrswk_r_watches_television_2017,hrsnight_r_sleeps_2017,cvc_wkswk_yr_all_l99
0,1.00,Female,9.00,"1,981.00",...,-5.00,-5.00,-5.00,52.00
1,2.00,Male,7.00,"1,982.00",...,4 to 6 hours a week,3 to 10 hours a week,6.00,0.00
2,3.00,Female,9.00,"1,983.00",...,10 hours or more a week,3 to 10 hours a week,6.00,0.00
3,4.00,Female,2.00,"1,981.00",...,1 to 3 hours a week,3 to 10 hours a week,6.00,4.00
4,5.00,Male,10.00,"1,982.00",...,Less than 1 hour a week,3 to 10 hours a week,5.00,12.00

In [53]:
# Checking the value Counts in the column govt_Responsibility _provide_jobs_2006
nlss97stata.govt_responsibility_provide_jobs_2006.value_counts(sort=False)

-5.0                        1425
-4.0                        5665
-2.0                          56
-1.0                           5
Definitely should be         454
Definitely should not be     300
Probably should be           617
Probably should not be       462
Name: govt_responsibility_provide_jobs_2006, dtype: int64

In [54]:
# In the above result there are few unwanted values that are marked with negative numbers. Fixing the missing logical values
nlss97stata.min()       # Checking the minimum values in each column

pubid_yth_id_code_1997                      1.00
keysex_symbol_1997                        Female
keybdate_my_symbol_1997                     1.00
keybdate_my_symbol_1997                 1,980.00
cv_sample_type_1997              Cross-sectional
keyrace_ethnicity_symbol_1997              Black
trans_sat_verbal_hstr                      -4.00
trans_sat_math_hstr                        -4.00
trans_crd_gpa_overall_hstr                 -9.00
trans_crd_gpa_eng_hstr                     -9.00
trans_crd_gpa_math_hstr                    -9.00
trans_crd_gpa_lp_sci_hstr                  -9.00
cv_ba_credits_l1_2011                      -5.00
cv_bio_child_hh_2017                       -5.00
cv_bio_child_nr_2017                       -5.00
hrsnight_r_sleeps_2017                     -5.00
cvc_wkswk_yr_all_l99                       -4.00
dtype: object

In [56]:
# Replacing the negative values with NULL values
nlss97stata.replace(list(range(-9,0)),np.NaN,inplace=True) # list(range(-9,0)) creates a list of values from -9 to -1. We are replace all values from -9 to -1 with NULL
nlss97stata.min()

pubid_yth_id_code_1997                      1.00
keysex_symbol_1997                        Female
keybdate_my_symbol_1997                     1.00
keybdate_my_symbol_1997                 1,980.00
cv_sample_type_1997              Cross-sectional
keyrace_ethnicity_symbol_1997              Black
trans_sat_verbal_hstr                      14.00
trans_sat_math_hstr                         7.00
trans_crd_gpa_overall_hstr                 10.00
trans_crd_gpa_eng_hstr                      0.00
trans_crd_gpa_math_hstr                     0.00
trans_crd_gpa_lp_sci_hstr                   0.00
cv_ba_credits_l1_2011                       0.00
cv_bio_child_hh_2017                        0.00
cv_bio_child_nr_2017                        0.00
hrsnight_r_sleeps_2017                      0.00
cvc_wkswk_yr_all_l99                        0.00
dtype: object

In [57]:
# Setting Index to the dataframe
nlss97stata.set_index('pubid_yth_id_code_1997',inplace=True)

**IMPORTING SAS DATA**

In [58]:
root.withdraw()
sas_file=filedialog.askopenfilename(title="Browse the bdat file")
cat_file=filedialog.askopenfilename(title="Browse the bcat file")

In [60]:
nls97sas,metasas =pyreadstat.read_sas7bdat(sas_file,catalog_file=cat_file,formats_as_category=True)
nls97sas.columns=metasas.column_labels
nls97sas.columns=nls97sas.columns.str.lower().str.replace(' ','_').str.replace('[^a-z0-9_]','')
nls97sas.columns=nls97sas.columns.str.replace('__','_') # Replacing double underscore in the headers with single underscore
nls97sas.head()

,pubid_yth_id_code_1997,keysex_symbol_1997,keybdate_my_symbol_1997,keybdate_my_symbol_1997,...,hrswk_r_uses_a_computer_2017,hrswk_r_watches_television_2017,hrsnight_r_sleeps_2017,cvc_wkswk_yr_all_l99
0,1.00,Female,9.00,"1,981.00",...,NaN,NaN,nan,52.00
1,2.00,Male,7.00,"1,982.00",...,4 to 6 hours a week,3 to 10 hours a week,6.00,0.00
2,3.00,Female,9.00,"1,983.00",...,10 hours or more a week,3 to 10 hours a week,6.00,0.00
3,4.00,Female,2.00,"1,981.00",...,1 to 3 hours a week,3 to 10 hours a week,6.00,4.00
4,5.00,Male,10.00,"1,982.00",...,Less than 1 hour a week,3 to 10 hours a week,5.00,12.00

In [61]:
nls97sas.keysex_symbol_1997.value_counts()

Male      4599
Female    4385
Name: keysex_symbol_1997, dtype: int64